{
    "imagebaseurl":"https://natejswenson.github.io/",
    "name": "Nate J. Swenson",
    "role": "DevOps Engineering Leader",
    "linkedinId":"natejswenson",
    "skypeid": "",
    "roleDescription": " I have Implemented Zero downtime / high availability automated deployments using Jenkins; as well as a container based Jenkins architecture. I am highly skilled in architecting and implementing cloud based architecure.",
    "socialLinks":[
        {
          "name":"linkedin",
          "url":"https://www.linkedin.com/in/natejswenson/",
          "className":"fa fa-linkedin"
        },
        {
          "name":"github",
          "url":"http://github.com/natejswenson",
          "className":"fa fa-github"
        }
      ],
    "aboutme":"I am a servant leader with 12 years of experience and in Software Engineering, DevOps, and digital transformation. I am currently leading a distributed DevOps team focused on maturing deployment practices and implementing a contanerized cloud stategy utizing Kubernetes.",
    "hobies":"In my free time I enjoy being active, hainging out with my family and learning new techy stuff. I recently read living with a seal and Can't Hurt Me both which have really made me try to become more mentally strong, especially when it comes to physical challenges; for me that is running. I am married and have two girls that I try to spend as much time with as I can. My daughters are the reason I have gotten so involved with STEM programs, and helping with Lego League Robotics. I Also enjoy learning new things by doing cool projects like writing alexa skills, automating my house and helping friends create websites for their bussinesses.",
    "email":"swen407@gmail.com",
    "address":"Minnesota, USA",
    "website":"https://natejswenson.github.io",
    "education":[
      {
        "UniversityName":"University of Minnesota",
        "specialization":"B.S.Industrial Engineering",
        "MonthOfPassing":"Dec",
        "YearOfPassing":"2010"
      }
    ],
    "work":[
      {
        "Company":"Discover Financial Services",
        "specialization":"Lead Cloud Engineer",
        "MonthOfLeaving":"",
        "YearOfLeaving":"Current",
        "toolsused":"Docker,AnsibleTower, AWS, GitHub",
        "Overview":"Lead engineer on the cloud foundations team responsible for Ansible Tower",
        "Achievements":[
            "Updgraded Ansible Tower from version 3.6 => 3.8",
            "Onboarded new teams to Ansible tower and helped engineer customized templates and integrations",
            "Automated application onboarding proccess for assignment of IAM policies to S3 buckets through use of Lambdas, DynamoDB, Jenkins, and ANsible Tower.",
            "SME for Ansible Tower."
          
        ]
        
      },
        {
         "Company":"Optum",   
        "specialization":"Lead DevOps Engineer",
        "MonthOfLeaving":"",
        "YearOfLeaving":"Current",
        "toolsused":"Jenkins, Ansible, Chef, Docker, VMWare, AnsibleTower, Octupus",
        "Overview":"Lead an engineering team focused on DevOps across OptumServe/LHI as well as tool owner for Jenkins Chef and GitHub.",
        "Achievements":[
            "Implemented a Zero downtime / high Blue – Green deployment strategy that utilized Jenkins and Octupus",
            "Moved from Manual Patching to Automated Patching using Ansile tower and SolarWinds",
            "Implemented Container Based Jenkins Infrastructure which provided much more scalability and recoverability."
        
            ]
        },
        {
        "Company":"Optum",
        "MonthOfLeaving":"Sep",
        "YearOfLeaving":"2019",
        "specialization":"DevOps Community Lead",
        "toolsused":"Jenkins, Ansible, Chef, Docker, VMWare, AnsibleTower, Octupus",
        "Overview":"Lead a distributed team working on creating stronger internal Agile and Engineering communities of practice that spans an organization that is 235K people.",
        "Achievements":[ 
            "Lead the internal training team for software engineering and DevOps.",
            "Developed and delivered hands on training focused on TDD, Pair programming and other XP practices.",
            "Growth and NPS reporting to senior Leadership."
        ]
        },
        {
        "Company":"Optum",
        "specialization":"Senior DevOps Engineer",
        "MonthOfLeaving":"Jan",
        "YearOfLeaving":"2019",
        "toolsused":"Jenkins, Ansible, Chef, Docker, VMWare, AnsibleTower, Octupus",
        "Overview":"Acted as both an individual contrubitor and techical coach focused on CI/CD and Automated Testing",
        "Achievements":[ 
            "Successfully migrated legacy control software for a projects worth upwards of three million USD.",
            "ILed the development for 27 well sites across western ND.",
            "Introduced TDD and ATDD as well as other XP programing practices to my development teams, which led to decreased cycle time and fewer defects."  
        ]
        
        },
        {
        "Company":"Novaspect",
        "specialization":"Lead Developer",
        "MonthOfLeaving":"Jan",
        "YearOfLeaving":"2016",
        "toolsused":"Jenkins, Ansible, Chef, Docker, VMWare, AnsibleTower, Octupus",
        "Overview":"Lead engineer for wellhead and other oil and gas projects for customers in the Western ND and Montana",
        "Achievements":[ 
            "Successfully migrated legacy control software for a projects worth upwards of three million USD.",
            "ILed the development for 27 well sites across western ND.",
            "Introduced TDD and ATDD as well as other XP programing practices to my development teams, which led to decreased cycle time and fewer defects."  
        ]
        }
        ],
    "skillsDescription":"Your skills here",
    "skills":[
      {
        "skillname":"Docker",
        "image":"images/docker.png",
        "number":"70",
        "color":"orange"
      },
      {
        "skillname":"NodeJS",
        "image":"images/nodejs.png",
        "number":"80",
        "color":"green"
      }, 
      {
        "skillname":"Ansible",
        "image":"images/ansible.png",
        "number":"80",
        "color":"green"
      },
      {
        "skillname":"Jenkins",
        "image":"images/jenkins.png",
        "number":"80",
        "color":"green"
      },
      {
        "skillname":"AWS",
        "image":"images/aws.png",
        "number":"70",
        "color":"orange"
      }
    ],
    "portfolio":[
      {
        "name":"Annoy My Mom",
        "description": "Top rated Alexa skill built using NodeJs.",
        "imgurl":"images/Annoymymom.png",
        "url":"https://github.com/natejswenson/AnnoyMyMom/"
      },
      {
        "name":"My Coach",
        "description":"Alexa skill build using NodeJS. My Coach offers motivation as you are guided through your choice of chest, legs, abs, and cardio workouts that can be done in around 7 minutes minutes and require no additional fitness equipment. To prevent boredom the exercises for each workout are on seven day rotations. **Each day after you complete a workout you will be notified of what tomorrows workout is** Also if you have suggestions for exercise you would like added in let me know, I'll listen. Below is one day of exercise:",
        "imgurl":"images/mycoach.png",
        "url":"https://github.com/natejswenson/MyCoach"
      },
      {
        "name":"Relaxing Plank",
        "description":"Alexa Skill built using NodeJs. Plank workout with relaxing ocean sounds playing in the background to allows you to meditate while you workout.",  
        "imgurl":"images/relaxingplank.png"
      },
      {
        "name":"Git Hub",
        "description":"Check it out; my goal for 2021 is to be active every day!",  
        "imgurl":"images/github.png"
      }
    ],
    "testimonials":[
      {
        "description":"Nate was a key member of my team, acting both as my teams agile coah as a highly adept engineer.",
        "name":"Tom Bast, Optum"
      },
      {
        "description":"I worked with Nate in supporting some critical remediation initiatives at UnitedHealth Group. Nate brought his technical savvy and helped our operations group get efficient around critical reporting needs. He even introduced new automation that reduced the amount of time the teams spent manually working on reports. On top of that, he's a fantastic team mate. He is supportive, collaborative and a pleasure to work with!",
        "name":"Divya Prabhakar, Optum"
      },
      {
        "description":"I had the pleasure to work under Nate as a Software Engineer in the DevOps space. Nate was such a pleasure to work with for any developer out there. Nate gave us complete freedom to try new things, implement new technologies, and show off Proof of Concepts wherever we saw fit. As an engineer, I am always excited to learn about new technologies and Nate gave us the complete freedom to do so. Under Nate, our team was able to implement Ansible and Jenkins, along many other tools to implement Automated Patching and Automated Backups to 500 servers. This was a first for our division, and a big win in terms of automation. Nate was an awesome leader, and really made working so much fun, as well as highly encouraging further learning.",
        "name":"Veeral Patel, Optum"
      },
      {
        "description":"Nate Swenson is the quintessential team player. He is always among the first to volunteer, and will help support his teammates in whatever way he can. As Nate has emerged into a leader, he's carried that servant leadership approach with him. As a skilled engineer who understands the importance of technical practices such as Test-Driven Development, Continuous Integration, and Continuous Delivery; Nate understands how to build quality in. Couple that with his now extensive experience as an Agile Practitioner, and Nate has developed a coaching skillset to compliment his technical expertise. This makes him a dual threat, and someone who can contribute significantly to whichever teams and organizations he is a part of.",
        "name":"Robert Wiedner, Optum"
      }
    ]
  }
  