{
    "imagebaseurl":"https://natejswenson.github.io/",
    "name": "Nate J. Swenson",
    "role": "Cloud & DevOps Engineer",
    "linkedinId":"natejswenson",
    "skypeid": "",
    "roleDescription": "Cloud & DevOps Engineer | AWS Specialist | Certified Scrum Professional | Continuous Learner | Author | Runner | Dad\nSpecializing in Cloud Computing, AWS, and Infrastructure Automation\nFollow Nate on LinkedIn and GitHub: @natejswenson",
    "socialLinks":[
        {
          "name":"linkedin",
          "url":"https://www.linkedin.com/in/natejswenson/",
          "className":"fa fa-linkedin"
        },
        {
          "name":"github",
          "url":"http://github.com/natejswenson",
          "className":"fa fa-github"
        }
      ],
    "aboutme":"Nate J. Swenson is a results-driven DevOps engineer specializing in Cloud Computing and AWS, with over 12 years of experience within Fortune 100 companies in the insurance and finance sectors. As a certified cloud professional, Nate focuses on architecting scalable cloud infrastructure, implementing CI/CD pipelines, and coaching teams on DevOps best practices.\n\nCurrently serving as a Senior DevOps Engineer at GoodLeap, Nate drives cloud infrastructure initiatives, automates deployment processes, and mentors engineering teams on AWS services and cloud-native solutions.",
    "hobies":"Outside of work, Nate can be found hanging out with his wife and two daughters, exploring the outdoors, or tinkering with his custom home automation setup.",
    "email":"natejswenson@gmail.com",
    "address":"Minnesota, USA",
    "website":"https://natejswenson.github.io",
    "education":[
      {
        "UniversityName":"University of Minnesota-Duluth",
        "specialization":"B.S. Industrial Engineering",
        "MonthOfPassing":"May",
        "YearOfPassing":"2010",
        "YearOfStarting":"2005"
      }
    ],
    "work":[
      {
        "Company":"GoodLeap",
        "specialization":"Senior DevOps Engineer",
        "MonthOfLeaving":"",
        "YearOfLeaving":"Current",
        "Achievements":[
          "Architected and implemented AWS cloud infrastructure supporting sustainable home improvement financing platform",
          "Led migration of legacy systems to cloud-native architecture using EKS, Lambda, and serverless technologies",
          "Designed and deployed automated CI/CD pipelines using GitLab CI, reducing deployment time by 60%",
          "Implemented Infrastructure as Code using Terraform and CloudFormation for multi-account AWS environments",
          "Mentored engineering teams on AWS best practices, achieving 100% team AWS certification",
          "Winner of 'Arch Forward Award' at company hackathon (November 2024) for innovative cloud automation solution"
        ]

      },
      {
        "Company":"Fannie Mae",
        "specialization":"DevOps Engineer (Lead Associate)",
        "MonthOfLeaving":"October",
        "YearOfLeaving":"2022",
        "Achievements":[
            "Architected an on-prem greenfield installation of GitLab on AWS",
            "Setup aws acount specific runner EKS runners team provision using Cloud Formation template when they are onboarded to the platform",
            "Partnered with information security team to design and imlement a compliance framework in GitLab which contained the existing 96 non functional requirments and is added to every team and project which onboards to the platform "
    
        ]
        
      },
      {
        "Company":"Discover Financial Services",
        "specialization":"Cloud Engineer (Lead)",
        "MonthOfLeaving":"May",
        "YearOfLeaving":"2021",
        "Achievements":[
            "Updgraded Ansible Tower from version 3.6 => 3.8 and moved host infrastructure to EKS",
            "Created temporary access layer in AWS using lambda functions to grant users credentials to higher restricted environments with ServiceNow integration"
    
        ]
        
      },
        {
         "Company":"Optum",   
        "specialization":"DevOps Engineer (Lead)",
        "MonthOfLeaving":"Dec",
        "YearOfLeaving":"2020",
        "Achievements":[
            "Implemented geographic redundancy and automatic failovers in AWS for front end services which resulting in application availability to increase from 96.7% to 99.1%",
            "Automated patching of physical, on-prem servers using Ansile tower and SolarWinds which saved 425 hours monthly",
            "Upgraded Jenkins Infrastructure to utilize containers hosted on openshift"
        
            ]
        },
        {
        "Company":"Optum",
        "MonthOfLeaving":"Sep",
        "YearOfLeaving":"2019",
        "specialization":"DevOps Engineer (Community Leader)",
        "Achievements":[ 
            "Led the internal training team for software engineering and DevOps.",
            "Developed and delivered hands on training focused on TDD, Pair programming and other XP practices.",
            "Growth and NPS reporting to senior Leadership."
        ]
        },
        {
        "Company":"Optum",
        "specialization":"DevOps Engineer (Senior)",
        "MonthOfLeaving":"Jan",
        "YearOfLeaving":"2019",
        "Achievements":[ 
            "Created automated testing framework as a jenkins library function which utilized  testcafe, cucumber, selenium and sauce-labs. ",
            "Active member in the internal engineering community which led me to take on my next role; DevOps community leader"
        ]
        
        },
        {
        "Company":"Novaspect",
        "specialization":"Automation Engineer (Lead)",
        "MonthOfLeaving":"Jan",
        "YearOfLeaving":"2016",
        "Achievements":[ 
            " Migrated legacy control software for a projects worth upwards of three million USD.",
            "Led development for 27 well sites across western ND.",
            "Introduced TDD and ATDD as well as other XP programing practices to my development teams, which led to decreased cycle time and fewer defects."  
        ]
        }
        ],
    "skillsDescription":"Your skills here",
    "skills":[
      {
        "skillname":"DevOps",
        "image":"cogs",
        "number":"100",
        "color":"teal"
      },
      {
        "skillname":"CICD",
        "image":"jenkins",
        "number":"90",
        "color":"teal"
      }, 
      {
        "skillname":"AWS",
        "image":"aws",
        "number":"80",
        "color":"teal"
      },
      {
        "skillname":"Agile Methodologies",
        "image":"aws",
        "number":"90",
        "color":"teal"
      },
      {
        "skillname":"Cloud Native",
        "image":"cloud",
        "number":"70",
        "color":"teal"
      }
    ],
    "portfolio":[
      {
        "name":"DevOps Career Handbook",
        "description": "Ultimate guide to pursuing a succesful career in DevOps",
        "imgurl":"images/book.jpg",
        "url":"https://www.amazon.com/gp/product/B09Z6R6FD7/ref=dbs_a_def_rwt_bibl_vppi_i0"
      },
      {
        "name":"Annoy My Mom",
        "description": "Top rated Alexa skill built using NodeJs.",
        "imgurl":"images/Annoymymom.png",
        "url":"https://github.com/natejswenson/AnnoyMyMom/"
      },
      {
        "name":"My Coach",
        "description":"Alexa skill build using NodeJS. My Coach offers motivation as you are guided through your choice of chest, legs, abs, and cardio workouts that can be done in around 7 minutes minutes and require no additional fitness equipment. To prevent boredom the exercises for each workout are on seven day rotations. **Each day after you complete a workout you will be notified of what tomorrows workout is** Also if you have suggestions for exercise you would like added in let me know, I'll listen. Below is one day of exercise:",
        "imgurl":"images/mycoach.png",
        "url":"https://github.com/natejswenson/MyCoach"
      },
      {
        "name":"Relaxing Plank",
        "description":"Alexa Skill built using NodeJs. Plank workout with relaxing ocean sounds playing in the background to allows you to meditate while you workout.",  
        "imgurl":"images/relaxingplank.png"
      },
      {
        "name":"Git Hub",
        "description":"nothing worth seeing",  
        "imgurl":"images/github.png"
      }
    ],
    "testimonials":[
      {
        "description":"Nate was a key member of my team, acting both as my teams agile coah as a highly adept engineer.",
        "name":"Tom Bast, Optum"
      },
      {
        "description":"I worked with Nate in supporting some critical remediation initiatives at UnitedHealth Group. Nate brought his technical savvy and helped our operations group get efficient around critical reporting needs. He even introduced new automation that reduced the amount of time the teams spent manually working on reports. On top of that, he's a fantastic team mate. He is supportive, collaborative and a pleasure to work with!",
        "name":"Divya Prabhakar, Optum"
      },
      {
        "description":"I had the pleasure to work under Nate as a Software Engineer in the DevOps space. Nate was such a pleasure to work with for any developer out there. Nate gave us complete freedom to try new things, implement new technologies, and show off Proof of Concepts wherever we saw fit. As an engineer, I am always excited to learn about new technologies and Nate gave us the complete freedom to do so. Under Nate, our team was able to implement Ansible and Jenkins, along many other tools to implement Automated Patching and Automated Backups to 500 servers. This was a first for our division, and a big win in terms of automation. Nate was an awesome leader, and really made working so much fun, as well as highly encouraging further learning.",
        "name":"Veeral Patel, Optum"
      },
      {
        "description":"Nate Swenson is the quintessential team player. He is always among the first to volunteer, and will help support his teammates in whatever way he can. As Nate has emerged into a leader, he's carried that servant leadership approach with him. As a skilled engineer who understands the importance of technical practices such as Test-Driven Development, Continuous Integration, and Continuous Delivery; Nate understands how to build quality in. Couple that with his now extensive experience as an Agile Practitioner, and Nate has developed a coaching skillset to compliment his technical expertise. This makes him a dual threat, and someone who can contribute significantly to whichever teams and organizations he is a part of.",
        "name":"Robert Wiedner, Optum"
      }
    ]
  }
  